In [3]:
pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\109-1\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.2.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\109-1\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\109-1\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   - -------------------------------------- 0.6/11.5 MB 11.5 MB/s eta 0:00:01
   ---- ----------------------------------- 1.3/11.5 MB 16.7 MB/s eta 0:00:01
   -------- ------------------------------- 2.5/11.5 MB 19.9 MB/s eta 0:00:01
   ---------------- ----------------------- 4.8/11.5 MB 27.6 MB/s eta 0:00:01
   ------------------------- -------------- 7.5/11.5 MB 36.7 MB/s eta 0:00:01
   --------------------------------- ------ 9.7/11.5 MB 44.3 MB/s eta 0:00:01
   --------------------------------- ------ 9.7/11.5 MB 44.3 MB/s eta 0:00:01
   ---------------------------------- ----- 9.9/11.5 MB 30.3 MB/s eta 0:00:01
   ------------------------------------ --- 10.6/11.5 MB 29.7 MB/s eta 0:00:01
   ---------------------------------------  11.5/11.5 MB 29.7 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 27.3 MB/s eta 0:00:00
Downloading pytz-2024.2-py2.py3-none-any.whl (508 kB)
   ---------------------------------------- 0.0/508.0 kB ? eta -:--:--
   --------------------------------------- 508.0/508.0 kB 31.1 MB/s eta 0:00:00
Downloading tzdata-2024.2-py2.py3-none-any.whl (346 kB)
   ---------------------------------------- 0.0/346.6 kB ? eta -:--:--
   --------------------------------------- 346.6/346.6 kB 22.4 MB/s eta 0:00:00
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2024.2 tzdata-2024.2
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
pip install numpy

Collecting numpy
  Downloading numpy-2.2.0-cp312-cp312-win_amd64.whl.metadata (60 kB)
     ---------------------------------------- 0.0/60.8 kB ? eta -:--:--
     ---------------------------------------- 60.8/60.8 kB 1.1 MB/s eta 0:00:00
Downloading numpy-2.2.0-cp312-cp312-win_amd64.whl (12.6 MB)
   ---------------------------------------- 0.0/12.6 MB ? eta -:--:--
   - -------------------------------------- 0.3/12.6 MB 7.0 MB/s eta 0:00:02
   ---- ----------------------------------- 1.5/12.6 MB 16.3 MB/s eta 0:00:01
   ----------- ---------------------------- 3.8/12.6 MB 26.7 MB/s eta 0:00:01
   ---------------- ----------------------- 5.2/12.6 MB 30.4 MB/s eta 0:00:01
   ------------------------- -------------- 8.0/12.6 MB 34.1 MB/s eta 0:00:01
   --------------------------- ------------ 8.8/12.6 MB 33.1 MB/s eta 0:00:01
   ------------------------------ --------- 9.5/12.6 MB 30.4 MB/s eta 0:00:01
   -------------------------------- ------- 10.2/12.6 MB 27.2 MB/s eta 0:00:01
   --------------------------------- ------ 10.6/12.6 MB 27.3 MB/s eta 0:00:01
   ---------------------------------- ----- 11.0/12.6 MB 25.2 MB/s eta 0:00:01
   ----------------------------------- ---- 11.2/12.6 MB 23.4 MB/s eta 0:00:01
   ------------------------------------ --- 11.5/12.6 MB 21.8 MB/s eta 0:00:01
   ------------------------------------ --- 11.6/12.6 MB 19.8 MB/s eta 0:00:01
   ------------------------------------- -- 11.7/12.6 MB 18.2 MB/s eta 0:00:01
   ------------------------------------- -- 11.8/12.6 MB 16.8 MB/s eta 0:00:01
   ------------------------------------- -- 11.9/12.6 MB 16.0 MB/s eta 0:00:01
   -------------------------------------- - 12.0/12.6 MB 14.9 MB/s eta 0:00:01
   ---------------------------------------  12.3/12.6 MB 14.2 MB/s eta 0:00:01
   ---------------------------------------  12.5/12.6 MB 13.1 MB/s eta 0:00:01
   ---------------------------------------- 12.6/12.6 MB 12.6 MB/s eta 0:00:00
Installing collected packages: numpy
Successfully installed numpy-2.2.0
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [4]:
import numpy as np
import pandas as pd

s = pd.Series([1, 3, 5, np.nan, 6, 8], name='first')
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
Name: first, dtype: float64

In [5]:
s.name

'first'

In [6]:
s.index

RangeIndex(start=0, stop=6, step=1)

In [8]:
s.values

array([ 1.,  3.,  5., nan,  6.,  8.])

In [10]:
s.shape

(6,)

In [11]:
s.size

6

In [12]:
s[1]

np.float64(3.0)

In [14]:
s[1:5]

1    3.0
2    5.0
3    NaN
4    6.0
Name: first, dtype: float64

In [15]:
s.index = list('abcdef')

In [16]:
print(s['b'], s['d'])

3.0 nan

In [17]:
s['c':'e']

c    5.0
d    NaN
e    6.0
Name: first, dtype: float64

In [18]:
s['b':'f']

b    3.0
c    5.0
d    NaN
e    6.0
f    8.0
Name: first, dtype: float64

In [19]:
s[0:3]

a    1.0
b    3.0
c    5.0
Name: first, dtype: float64

In [20]:
s1 = s[1:4]
s1

b    3.0
c    5.0
d    NaN
Name: first, dtype: float64

In [21]:
s1[0]

C:\Users\109-1\AppData\Local\Temp\ipykernel_14516\643609873.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s1[0]

np.float64(3.0)

In [22]:
s1[0] = 10
s1

C:\Users\109-1\AppData\Local\Temp\ipykernel_14516\1715506060.py:1: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  s1[0] = 10

b    10.0
c     5.0
d     NaN
Name: first, dtype: float64

In [23]:
s

a     1.0
b    10.0
c     5.0
d     NaN
e     6.0
f     8.0
Name: first, dtype: float64

In [24]:
s.index = np.arange(1, 7)
s

1     1.0
2    10.0
3     5.0
4     NaN
5     6.0
6     8.0
Name: first, dtype: float64

In [25]:
s[1]

np.float64(1.0)

In [26]:
s[0]

KeyError: 0

In [27]:
s[1:3]

2    10.0
3     5.0
Name: first, dtype: float64

In [29]:
import pandas as pd

age = pd.Series([9, 17, 32, 45, 65, 98], index=list('abcdef'), name='age')
age

a     9
b    17
c    32
d    45
e    65
f    98
Name: age, dtype: int64

In [30]:
age['b']

np.int64(17)

In [31]:
age[[1, 3, 5]]

C:\Users\109-1\AppData\Local\Temp\ipykernel_14516\1546391730.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  age[[1, 3, 5]]

b    17
d    45
f    98
Name: age, dtype: int64

In [32]:
age[['a', 'f', 'd']]

a     9
f    98
d    45
Name: age, dtype: int64

In [33]:
age[['c']]

c    32
Name: age, dtype: int64

In [34]:
import pandas as pd
s = pd.Series([3, 6, -3, 0, -4, 8, -7])
s

0    3
1    6
2   -3
3    0
4   -4
5    8
6   -7
dtype: int64

In [35]:
s > 0

0     True
1     True
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [36]:
s%2 == 0

0    False
1     True
2    False
3     True
4     True
5     True
6    False
dtype: bool

In [37]:
s[s > 0]

0    3
1    6
5    8
dtype: int64

In [38]:
s[~(s > 0)]

2   -3
3    0
4   -4
6   -7
dtype: int64

In [39]:
s[s%2 == 0]

1    6
3    0
4   -4
5    8
dtype: int64

In [42]:
s[s%2 != 0]

0    3
2   -3
6   -7
dtype: int64

In [43]:
s[(s > 0) & (s%2 == 0)]

1    6
5    8
dtype: int64

# Series 활용 함수

In [44]:
import pandas as pd

s = ['희빈', '수영', '현수', '지호', '지민']
p = pd.Series([99, 84, 92, 65, 78], index=s)
p

희빈    99
수영    84
현수    92
지호    65
지민    78
dtype: int64

In [45]:
p.name = '수학성적'
p.index.name = 'st_name'
p

st_name
희빈    99
수영    84
현수    92
지호    65
지민    78
Name: 수학성적, dtype: int64

In [46]:
p.sort_values()

st_name
지호    65
지민    78
수영    84
현수    92
희빈    99
Name: 수학성적, dtype: int64

In [47]:
p.sort_values(ascending=False)

st_name
희빈    99
현수    92
수영    84
지민    78
지호    65
Name: 수학성적, dtype: int64

In [48]:
p.sort_index()

st_name
수영    84
지민    78
지호    65
현수    92
희빈    99
Name: 수학성적, dtype: int64

In [49]:
p.sort_index(ascending=False)

st_name
희빈    99
현수    92
지호    65
지민    78
수영    84
Name: 수학성적, dtype: int64

In [50]:
print(p.max())
print(p.min())

99
65

In [51]:
print(p.mean())
print(p.median())

83.6
84.0

In [52]:
print(p.count())
print(p.size)

5
5

In [53]:
p.describe()

count     5.000000
mean     83.600000
std      13.088163
min      65.000000
25%      78.000000
50%      84.000000
75%      92.000000
max      99.000000
Name: 수학성적, dtype: float64

In [54]:
import numpy as np
import pandas as pd

s = pd.Series([3, 1, 1, 2, None, np.nan, 4, 6, 6, np.nan])
s

0    3.0
1    1.0
2    1.0
3    2.0
4    NaN
5    NaN
6    4.0
7    6.0
8    6.0
9    NaN
dtype: float64

In [55]:
s.values

array([ 3.,  1.,  1.,  2., nan, nan,  4.,  6.,  6., nan])

In [56]:
s.count()

np.int64(7)

In [57]:
s.value_counts()

1.0    2
6.0    2
3.0    1
2.0    1
4.0    1
Name: count, dtype: int64

In [58]:
s.value_counts(dropna=False)

NaN    3
1.0    2
6.0    2
3.0    1
2.0    1
4.0    1
Name: count, dtype: int64

In [59]:
s.value_counts(sort=False, dropna=False)

3.0    1
1.0    2
2.0    1
NaN    3
4.0    1
6.0    2
Name: count, dtype: int64

In [60]:
s.value_counts(sort=False, dropna=False)

3.0    1
1.0    2
2.0    1
NaN    3
4.0    1
6.0    2
Name: count, dtype: int64

In [61]:
s.value_counts(bins=4)

(0.994, 2.25]    3
(4.75, 6.0]      2
(2.25, 3.5]      1
(3.5, 4.75]      1
Name: count, dtype: int64

In [63]:
s.value_counts(bins=4, sort=False)

(0.994, 2.25]    3
(2.25, 3.5]      1
(3.5, 4.75]      1
(4.75, 6.0]      2
Name: count, dtype: int64

In [64]:
s.value_counts(bins=[0.5, 3.5, 6.5], sort=False)

(0.499, 3.5]    4
(3.5, 6.5]      3
Name: count, dtype: int64

# 데이터프레임 생성

In [65]:
import pandas as pd

df = pd.DataFrame([10, 20, 30, 40, 50])
df

    0
0  10
1  20
2  30
3  40
4  50

In [67]:
import pandas as pd

df = pd.DataFrame([[1, 2, 3], [10, 20, 30], [100, 200, 300]], index=list('abc'))
df

     0    1    2
a    1    2    3
b   10   20   30
c  100  200  300

In [70]:
df = pd.DataFrame([[1, 2, 3], [10, 20, 30], [100, 200, 300]], index=list('abc'), columns=['A', 'B', 'C'])
df

     A    B    C
a    1    2    3
b   10   20   30
c  100  200  300

In [71]:
print(df.index)
print(df.columns)

Index(['a', 'b', 'c'], dtype='object')
Index(['A', 'B', 'C'], dtype='object')

In [74]:
import numpy as np
import pandas as pd

df1 = pd.DataFrame(data = np.arange(12).reshape(3, 4))
df1

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [76]:
df1 = pd.DataFrame(np.random.randint(1, 46, (5, 6)))
df1

    0   1   2   3   4   5
0   3  44  22  25  27  10
1  13  38   3   8   5  32
2   2  12  37  18  15  29
3  18  28  17  16  28   6
4  24  44  43   8  10   1

In [78]:
df1 = pd.DataFrame(np.random.random((5, 6)))
df1

          0         1         2         3         4         5
0  0.947753  0.633631  0.587758  0.963012  0.994544  0.144594
1  0.853478  0.865147  0.023194  0.196091  0.204033  0.371963
2  0.987391  0.577550  0.404255  0.679039  0.142399  0.432592
3  0.481570  0.259883  0.675829  0.173093  0.437650  0.125695
4  0.830662  0.622737  0.352323  0.346059  0.550305  0.107118

In [79]:
df = pd.DataFrame({'numbers': [1, 2, 3], 'colors': ['red', 'white', 'blue']})
df

   numbers colors
0        1    red
1        2  white
2        3   blue

In [80]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [81]:
df.columns

Index(['numbers', 'colors'], dtype='object')

In [82]:
df = pd.DataFrame({'국어': [82, 76, 67], '수학': [99, 87, 78]}, index=['김국진', '신영희', '이길순'])
df

     국어  수학
김국진  82  99
신영희  76  87
이길순  67  78

In [83]:
df.index

Index(['김국진', '신영희', '이길순'], dtype='object')

In [84]:
df.columns

Index(['국어', '수학'], dtype='object')

In [85]:
courses = pd.Series(["Spark", "PySpark", "Hadoop"], name='courses')
courses

0      Spark
1    PySpark
2     Hadoop
Name: courses, dtype: object

In [86]:
fees = pd.Series([250000, 300000, 200000], name='fees')
fees

0    250000
1    300000
2    200000
Name: fees, dtype: int64

In [87]:
df = pd.DataFrame({courses.name: courses, fees.name: fees})
df

   courses    fees
0    Spark  250000
1  PySpark  300000
2   Hadoop  200000

In [88]:
courses = pd.Series(["Spark", "PySpark", "Hadoop"], name='courses')
fees = pd.Series([250000, 300000, 200000], name='fees')

df = pd.concat([courses, fees], axis=1)
df

   courses    fees
0    Spark  250000
1  PySpark  300000
2   Hadoop  200000

In [89]:
courses = pd.Series(["Spark", "PySpark", "Hadoop"], name='courses')
fees = pd.Series([250000, 300000, 200000], name='fees')

df = pd.concat([courses, fees])
df

0      Spark
1    PySpark
2     Hadoop
0     250000
1     300000
2     200000
dtype: object

In [90]:
courses = pd.Series(["Spark", "PySpark", "Hadoop"], name='courses')
fees = pd.Series([250000, 300000, 200000], name='fees')

df = pd.DataFrame([courses, fees])
df

              0        1       2
courses   Spark  PySpark  Hadoop
fees     250000   300000  200000

In [91]:
df.T

   courses    fees
0    Spark  250000
1  PySpark  300000
2   Hadoop  200000

In [92]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [98]:
courses = pd.Series(["Spark", "PySpark", "Hadoop"], name='courses')
df[courses.name] = courses
df

   courses
0    Spark
1  PySpark
2   Hadoop

In [99]:
fees = pd.Series([250000, 300000, 200000], name='fees')
df[fees.name] = fees
df

   courses    fees
0    Spark  250000
1  PySpark  300000
2   Hadoop  200000

In [100]:
import pandas as pd

df = pd.DataFrame([{'국어': 70, '수학': 89, '영어': 90}, {'국어': 80, '영어': 99}, {'수학': 66, '영어': 78}])
df

     국어    수학  영어
0  70.0  89.0  90
1  80.0   NaN  99
2   NaN  66.0  78

In [102]:
import pandas as pd

s1 = pd.Series([90, 80, 60, 66])
s2 = pd.Series([45, 73, 83, 99])
s3 = pd.Series([92, 75, 82, 75])
s1

0    90
1    80
2    60
3    66
dtype: int64

In [103]:
df = pd.DataFrame({'국어': s1, '영어': s2, '수학': s3})
df

   국어  영어  수학
0  90  45  92
1  80  73  75
2  60  83  82
3  66  99  75

In [104]:
df.index = ['노', '장', '박', '강']
df

   국어  영어  수학
노  90  45  92
장  80  73  75
박  60  83  82
강  66  99  75

In [105]:
df = pd.DataFrame({'A': pd.Series([10, 20, 30], index=[0, 1, 2]), 'B': pd.Series([3, 2, 1], index=[1, 2, 3])})
df

      A    B
0  10.0  NaN
1  20.0  3.0
2  30.0  2.0
3   NaN  1.0

In [106]:
s1 = pd.Series([90, 80, 60], index=['노', '장', '박'])
s2 = pd.Series([45, 73, 99], index=['장', '박', '강'])
s3 = pd.Series([92, 75, 82, 75])

In [107]:
df = pd.DataFrame({'국어': s1, '영어': s2, '수학': s3}, index=['노', '장', '박', '강'])
df

     국어    영어  수학
노  90.0   NaN NaN
장  80.0  45.0 NaN
박  60.0  73.0 NaN
강   NaN  99.0 NaN

In [108]:
d = {'col1': [1, 2], 'col2': [3, 4]}
df = pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

In [109]:
df.dtypes

col1    int64
col2    int64
dtype: object

In [110]:
df = pd.DataFrame(data=d, dtype=np.int8)
df.dtypes

col1    int8
col2    int8
dtype: object

In [111]:
dates = pd.date_range("20250101", periods=6)
dates

DatetimeIndex(['2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04',
               '2025-01-05', '2025-01-06'],
              dtype='datetime64[ns]', freq='D')

In [112]:
dates[0]

Timestamp('2025-01-01 00:00:00')

In [113]:
dates = pd.date_range("20250101", end='20250110')
dates

DatetimeIndex(['2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04',
               '2025-01-05', '2025-01-06', '2025-01-07', '2025-01-08',
               '2025-01-09', '2025-01-10'],
              dtype='datetime64[ns]', freq='D')

In [114]:
dates = pd.date_range("20250101",periods=6, freq='3D')
dates

DatetimeIndex(['2025-01-01', '2025-01-04', '2025-01-07', '2025-01-10',
               '2025-01-13', '2025-01-16'],
              dtype='datetime64[ns]', freq='3D')

In [115]:
dates = pd.date_range("20250101",periods=6, freq='3H')
dates

C:\Users\109-1\AppData\Local\Temp\ipykernel_14516\937328357.py:1: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  dates = pd.date_range("20250101",periods=6, freq='3H')

DatetimeIndex(['2025-01-01 00:00:00', '2025-01-01 03:00:00',
               '2025-01-01 06:00:00', '2025-01-01 09:00:00',
               '2025-01-01 12:00:00', '2025-01-01 15:00:00'],
              dtype='datetime64[ns]', freq='3h')

In [116]:
dates = pd.date_range("20250101",periods=6, freq='W')
dates

DatetimeIndex(['2025-01-05', '2025-01-12', '2025-01-19', '2025-01-26',
               '2025-02-02', '2025-02-09'],
              dtype='datetime64[ns]', freq='W-SUN')

In [117]:
dates = pd.date_range("20240101",periods=6, freq='W')
dates

DatetimeIndex(['2024-01-07', '2024-01-14', '2024-01-21', '2024-01-28',
               '2024-02-04', '2024-02-11'],
              dtype='datetime64[ns]', freq='W-SUN')

In [118]:
dates = pd.date_range("20240101",periods=6, freq='W-TUE')
dates

DatetimeIndex(['2024-01-02', '2024-01-09', '2024-01-16', '2024-01-23',
               '2024-01-30', '2024-02-06'],
              dtype='datetime64[ns]', freq='W-TUE')

In [119]:
dates = pd.date_range("20240101",periods=6, freq='W-FRI')
dates

DatetimeIndex(['2024-01-05', '2024-01-12', '2024-01-19', '2024-01-26',
               '2024-02-02', '2024-02-09'],
              dtype='datetime64[ns]', freq='W-FRI')

In [120]:
dates = pd.date_range("20240101",periods=6, freq='M')
dates

C:\Users\109-1\AppData\Local\Temp\ipykernel_14516\849161410.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  dates = pd.date_range("20240101",periods=6, freq='M')

DatetimeIndex(['2024-01-31', '2024-02-29', '2024-03-31', '2024-04-30',
               '2024-05-31', '2024-06-30'],
              dtype='datetime64[ns]', freq='ME')

In [121]:
dates = pd.date_range("20240101",periods=6, freq='MS')
dates

DatetimeIndex(['2024-01-01', '2024-02-01', '2024-03-01', '2024-04-01',
               '2024-05-01', '2024-06-01'],
              dtype='datetime64[ns]', freq='MS')

In [122]:
dates = pd.date_range("20240101",periods=6)
dates

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-06'],
              dtype='datetime64[ns]', freq='D')

In [123]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2024-01-01 -0.456341 -0.400253 -0.524857  0.695024
2024-01-02  0.026165 -1.142139 -0.457284  2.220863
2024-01-03  0.073516  0.822471  0.450265 -1.079941
2024-01-04  0.950861 -0.991944  1.300911  1.301121
2024-01-05  0.392969 -1.467221  0.290809  0.345084
2024-01-06 -2.378237 -1.145441  0.167578 -0.703719

In [126]:
df2 = pd.DataFrame(
{
    "A": 1.0,
    "B": pd.Timestamp("20260302"),
    "C": pd.Series(np.arange(1, 3, .5)),
    "D": np.array([3] * 4, dtype="int32"),
    "E": pd.Categorical(["test", "train", "test", "train"]),
    "F": "foo",
}
)
df2

     A          B    C  D      E    F
0  1.0 2026-03-02  1.0  3   test  foo
1  1.0 2026-03-02  1.5  3  train  foo
2  1.0 2026-03-02  2.0  3   test  foo
3  1.0 2026-03-02  2.5  3  train  foo

In [139]:
pf = pd.DataFrame(data = [[25, 35, 8, 18], [18, 27, 10, 20], [17, 17, 10, 19], [12, 22, 9, 20], [22, 34, 8, 16]], index=['윤일형', '강수희', '홍소희', '유한빈', '신수빈'], columns=['중간', '기말', '과제', '출석'])
pf

     중간  기말  과제  출석
윤일형  25  35   8  18
강수희  18  27  10  20
홍소희  17  17  10  19
유한빈  12  22   9  20
신수빈  22  34   8  16

In [128]:
pf['중간']

윤길형    25
강수희    18
홍소희    17
유한빈    12
신수빈    22
Name: 중간, dtype: int64

In [129]:
pf['기말']

윤길형    35
강수희    27
홍소희    17
유한빈    22
신수빈    34
Name: 기말, dtype: int64

In [130]:
pf['출석']

윤길형    18
강수희    20
홍소희    19
유한빈    20
신수빈    16
Name: 출석, dtype: int64

In [132]:
pf[['기말', '출석', '중간']]

     기말  출석  중간
윤길형  35  18  25
강수희  27  20  18
홍소희  17  19  17
유한빈  22  20  12
신수빈  34  16  22

In [133]:
pf[['기말']]

     기말
윤길형  35
강수희  27
홍소희  17
유한빈  22
신수빈  34

In [134]:
pf['중간'] > 20

윤길형     True
강수희    False
홍소희    False
유한빈    False
신수빈     True
Name: 중간, dtype: bool

In [135]:
pf[pf['중간'] > 20]

     중간  기말  과제  출석
윤길형  25  35   8  18
신수빈  22  34   8  16

In [136]:
pf[pf['출석'] >= 19]

     중간  기말  과제  출석
강수희  18  27  10  20
홍소희  17  17  10  19
유한빈  12  22   9  20

In [137]:
pf[(pf['출석'] >= 19) & (pf['기말'] >= 20)]

     중간  기말  과제  출석
강수희  18  27  10  20
유한빈  12  22   9  20

In [140]:
pf.loc['윤일형']

중간    25
기말    35
과제     8
출석    18
Name: 윤일형, dtype: int64

In [141]:
pf.loc[['윤일형']]

     중간  기말  과제  출석
윤일형  25  35   8  18

In [142]:
pf.loc[['홍소희', '윤일형']]

     중간  기말  과제  출석
홍소희  17  17  10  19
윤일형  25  35   8  18

In [143]:
pf.loc['윤일형':'유한빈']

     중간  기말  과제  출석
윤일형  25  35   8  18
강수희  18  27  10  20
홍소희  17  17  10  19
유한빈  12  22   9  20

In [144]:
pf.loc[pf.중간 > 20]

     중간  기말  과제  출석
윤일형  25  35   8  18
신수빈  22  34   8  16

In [145]:
pf.loc[(pf.중간 > 10) & (pf.과제 == 10)]

     중간  기말  과제  출석
강수희  18  27  10  20
홍소희  17  17  10  19

In [146]:
pf.loc[pf.index[0]]

중간    25
기말    35
과제     8
출석    18
Name: 윤일형, dtype: int64

In [147]:
pf.loc[[pf.index[0]]]

     중간  기말  과제  출석
윤일형  25  35   8  18

In [149]:
pf.loc[pf.index[1:4]]

     중간  기말  과제  출석
강수희  18  27  10  20
홍소희  17  17  10  19
유한빈  12  22   9  20

In [151]:
pf.loc[:, '과제']

윤일형     8
강수희    10
홍소희    10
유한빈     9
신수빈     8
Name: 과제, dtype: int64

In [152]:
pf.loc[:, '중간':'과제']

     중간  기말  과제
윤일형  25  35   8
강수희  18  27  10
홍소희  17  17  10
유한빈  12  22   9
신수빈  22  34   8

In [153]:
pf.loc[:, '기말':'출석']

     기말  과제  출석
윤일형  35   8  18
강수희  27  10  20
홍소희  17  10  19
유한빈  22   9  20
신수빈  34   8  16

In [155]:
pf.loc[:, pf.columns[0]]

윤일형    25
강수희    18
홍소희    17
유한빈    12
신수빈    22
Name: 중간, dtype: int64

In [154]:
pf.loc[:, [pf.columns[0]]]

     중간
윤일형  25
강수희  18
홍소희  17
유한빈  12
신수빈  22

In [156]:
pf.loc['윤일형', '출석']

np.int64(18)

In [157]:
pf.loc['윤일형':'유한빈', '기말']

윤일형    35
강수희    27
홍소희    17
유한빈    22
Name: 기말, dtype: int64

In [158]:
pf.loc['윤일형':'유한빈', '기말':'과제']

     기말  과제
윤일형  35   8
강수희  27  10
홍소희  17  10
유한빈  22   9

In [160]:
pf.loc[pf.index[0], pf.columns[1]]

np.int64(35)

In [161]:
pf.loc[pf.index[0:3], pf.columns[2]]

윤일형     8
강수희    10
홍소희    10
Name: 과제, dtype: int64

In [162]:
pf.loc[pf.index[0:3], pf.columns[2:]]

     과제  출석
윤일형   8  18
강수희  10  20
홍소희  10  19

# 올림픽 메달 집계

In [166]:
pip install lxml

Collecting lxmlNote: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

  Downloading lxml-5.3.0-cp312-cp312-win_amd64.whl.metadata (3.9 kB)
Downloading lxml-5.3.0-cp312-cp312-win_amd64.whl (3.8 MB)
   ---------------------------------------- 0.0/3.8 MB ? eta -:--:--
    --------------------------------------- 0.1/3.8 MB 1.7 MB/s eta 0:00:03
   ------ --------------------------------- 0.6/3.8 MB 9.4 MB/s eta 0:00:01
   ----------------- ---------------------- 1.7/3.8 MB 18.2 MB/s eta 0:00:01
   ---------------------------------------  3.8/3.8 MB 24.4 MB/s eta 0:00:01
   ---------------------------------------- 3.8/3.8 MB 24.4 MB/s eta 0:00:00
Installing collected packages: lxml
Successfully installed lxml-5.3.0

In [167]:
import pandas as pd

df = pd.read_html('https://ko.wikipedia.org/wiki/%EC%98%AC%EB%A6%BC%ED%94%BD_%EB%A9%94%EB%8B%AC_%EC%A7%91%EA%B3%84')
print(df)

[          국가 (IOC 코드)  하계 참가 횟수  Unnamed: 2  Unnamed: 3  Unnamed: 4  \
0        아프가니스탄 (AFG)        16           0           0           2
1          알바니아 (ALB)        10           0           0           2
2           알제리 (ALG)        15           7           4           9
3         아르헨티나 (ARG)        26          22          27          31
4         아르메니아 (ARM)         8           2          11           9
..                ...       ...         ...         ...         ...
158  개인 중립 (AIN)[AIN]         1           1           3           1
159     독립 (IOA)[IOA]         3           1           0           1
160  독립 참가 (IOP)[IOP]         1           0           1           2
161     혼성 (ZZX)[ZZX]         3          11           6           8
162                총합        30        5789        5759        6277

     Unnamed: 5  동계 참가 횟수  Unnamed: 7  Unnamed: 8  Unnamed: 9  Unnamed: 10  \
0             2         0           0           0           0            0
1             2         5           0           0           0            0
2            20         3           0           0           0            0
3            80        20           0           0           0            0
4            22         8           0           0           0            0
..          ...       ...         ...         ...         ...          ...
158           1         0           0           0           0            0
159           2         0           0           0           0            0
160           3         0           0           0           0            0
161          25         0           0           0           0            0
162       17825        24        1171        1169        1160         3500

     전체 참가 횟수  Unnamed: 12  Unnamed: 13  Unnamed: 14  Unnamed: 15
0          16            0            0            2            2
1          15            0            0            2            2
2          18            7            4            9           20
3          46           22           27           31           80
4          16            2           11            9           22
..        ...          ...          ...          ...          ...
158         1            1            3            1            5
159         3            1            0            1            2
160         1            0            1            2            3
161         3           11            6            8           25
162        54         6960         6928         7437        21325

[163 rows x 16 columns],          국가 (IOC 코드)  하계 참가 횟수  동계 참가 횟수  전체 참가 횟수
0         알바니아 (ALB)         8         4        12
1      아메리칸사모아 (ASA)         8         1         9
2          안도라 (AND)        11        12        23
3          앙골라 (ANG)         9         0         9
4      앤티가 바부다 (ANT)        10         0        10
..               ...       ...       ...       ...
74  중화민국 (ROC) [ROC]         3         0         3
75    자르 (SAA) [SAA]         1         0         1
76   북예멘 (YAR) [YAR]         2         0         2
77   남예멘 (YMD) [YMD]         1         0         1
78    난민 (ROT) [ROT]         1         0         1

[79 rows x 4 columns],                      국가 (IOC 코드) 하계 참가 횟수  Unnamed: 2  Unnamed: 3  Unnamed: 4  \
0                    독일 (GER)[5]       16         191         192         232
1              독일 (GER) (EUA)[6]       19         219         246         268
2        독일 (GER) (EUA) (FRG)[7]       24         275         313         349
3  독일 (GER) (EUA) (FRG) (GDR)[8]    25[9]         428         442         476

      계  동계 참가 횟수  Unnamed: 7  Unnamed: 8  Unnamed: 9  계.1 전체 참가 횟수  \
0   615        12          92          88          60  240       28
1   733        15         100          94          65  259       34
2   937        21         111         109          78  298       45
3  1346        21         150         145         113  408    46[9]

   Unnamed: 12  Unnamed: 13  Unnamed: 14    총합
0          283          280          292   855
1          319          340          333   992
2          386          422          427  1235
3          578          587          589  1754  ,                                 국가 (IOC 코드)  하계 참가 횟수  Unnamed: 2  Unnamed: 3  \
0                       러시아 출신 올림픽 선수 (OAR)         0           0           0
1                             러시아 (RUS)[10]         6         148         125
2                       러시아 (RUS) (RU1)[11]         9         149         129
3                               소련 (URS)[7]         9         395         319
4                         소련 (URS) (EUN)[8]        10         440         357
5  러시아 (RUS) (RU1) (OAR) 소련 (URS) (EUN)[12]        19         590         485

   Unnamed: 4     계  동계 참가 횟수  Unnamed: 7  Unnamed: 8  Unnamed: 9  계.1  \
0           0     0         1           2           6           9   17
1         153   426         6          47          38          35  120
2         156   434         6          47          38          35  120
3         296  1010         9          78          57          59  194
4         325  1122        10          87          63          67  217
5         481  1556        17         136         107         111  354

   전체 참가 횟수  Unnamed: 12  Unnamed: 13  Unnamed: 14    총합
0         1            2            6            9    17
1        12          195          163          188   546
2        12          195          163          188   546
3        18          473          376          355  1204
4        20          527          420          392  1339
5        36          726          592          592  1910  ,                                                    0  \
0  ANZ → AUS , NZL 오스트랄라시아(ANZ)는 오스트레일리아(AUS)와 뉴질...

                                                   1
0  SRB , YUG → IOP , SCG 세르비아(SRB, 1912년, 2006년~현...  ,                                                    0  \
0  BIZ 벨리즈는 1968년부터 1972년까지 영국령 온두라스(HBR)로 참가하였다....

                                                   1
0  GUY 1996년 가이아나는 독립하기 이전에 영국령 기아나라는 명칭으로 1948년부...  ,                                                    0  \
0  A 브루나이는 1988년 대회에 선수 없이 임원 한 명만을 보내었다. 이는 참가 집...

                                                   1
0  F 2014년 대회에 인도의 선수들은 인도 올림픽 협회의 자격 정지로 개막식에 올림...  ,                                                    0  \
0  H 불가리아 올림픽 위원회는 소피아에 거주하던 스위스의 체조 교사인 샤를 샴포가 1...

                                                   1
0  N 모나코는 1924년 하계 올림픽 예술에서 동메달을 획득하였다.[15] 그러나 I...  ,   vte올림픽 메달 집계                                     vte올림픽 메달 집계.1
0       하계 올림픽  1896 1900 1904 1908 1912 1920 1924 1928 1932 1...
1       동계 올림픽  1924 1928 1932 1936 1948 1952 1956 1960 1964 1...
2   하계 청소년 올림픽                                     2010 2014 2018
3   동계 청소년 올림픽                                     2012 2016 2020,   vte올림픽 메달리스트 목록                                  vte올림픽 메달리스트 목록.1
0           하계 종목  근대5종 농구 다이빙 레슬링 배구 배드민턴 복싱 비치발리볼 사격 사이클(남/여) 수...
1           동계 종목  노르딕복합 루지 바이애슬론 봅슬레이 쇼트트랙 스노보드 스켈레톤 스키점프 스피드스케이...
2           과거 종목  가라데 라크로스 라켓 로크 모터보트 밀리터리패트롤 소프트볼 야구 주드폼 줄다리기 크...
3           시범 종목  개썰매 글라이딩 글리마 동계5종 라칸 롤러하키 무도 미식축구 밴디 볼링 사바트 스키...
4          비공식 종목  게일릭풋볼 기구 낚시 롱그폼 모터레이싱 모터사이클 불 비둘기레이싱 사이클폴로 소방 ...]

In [168]:
print(type(df))
print(type(df[0]))

<class 'list'>
<class 'pandas.core.frame.DataFrame'>

In [169]:
import pandas as pd

df = pd.read_html('https://ko.wikipedia.org/wiki/%EC%98%AC%EB%A6%BC%ED%94%BD_%EB%A9%94%EB%8B%AC_%EC%A7%91%EA%B3%84')
df[0]

,국가 (IOC 코드),하계 참가 횟수,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,동계 참가 횟수,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,전체 참가 횟수,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15
0,아프가니스탄 (AFG),16,0,0,2,2,0,0,0,0,0,16,0,0,2,2
1,알바니아 (ALB),10,0,0,2,2,5,0,0,0,0,15,0,0,2,2
2,알제리 (ALG),15,7,4,9,20,3,0,0,0,0,18,7,4,9,20
3,아르헨티나 (ARG),26,22,27,31,80,20,0,0,0,0,46,22,27,31,80
4,아르메니아 (ARM),8,2,11,9,22,8,0,0,0,0,16,2,11,9,22
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
158,개인 중립 (AIN)[AIN],1,1,3,1,1,0,0,0,0,0,1,1,3,1,5
159,독립 (IOA)[IOA],3,1,0,1,2,0,0,0,0,0,3,1,0,1,2
160,독립 참가 (IOP)[IOP],1,0,1,2,3,0,0,0,0,0,1,0,1,2,3
161,혼성 (ZZX)[ZZX],3,11,6,8,25,0,0,0,0,0,3,11,6,8,25
162,총합,30,5789,5759,6277,17825,24,1171,1169,1160,3500,54,6960,6928,7437,21325

In [170]:
import pandas as pd

df = pd.read_html('https://ko.wikipedia.org/wiki/%EC%98%AC%EB%A6%BC%ED%94%BD_%EB%A9%94%EB%8B%AC_%EC%A7%91%EA%B3%84')
df2 = df[0].set_index('국가 (IOC 코드)')
df2

,하계 참가 횟수,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,동계 참가 횟수,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,전체 참가 횟수,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15
국가 (IOC 코드),,,,,,,,,,,,,,,
아프가니스탄 (AFG),16,0,0,2,2,0,0,0,0,0,16,0,0,2,2
알바니아 (ALB),10,0,0,2,2,5,0,0,0,0,15,0,0,2,2
알제리 (ALG),15,7,4,9,20,3,0,0,0,0,18,7,4,9,20
아르헨티나 (ARG),26,22,27,31,80,20,0,0,0,0,46,22,27,31,80
아르메니아 (ARM),8,2,11,9,22,8,0,0,0,0,16,2,11,9,22
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
개인 중립 (AIN)[AIN],1,1,3,1,1,0,0,0,0,0,1,1,3,1,5
독립 (IOA)[IOA],3,1,0,1,2,0,0,0,0,0,3,1,0,1,2
독립 참가 (IOP)[IOP],1,0,1,2,3,0,0,0,0,0,1,0,1,2,3
혼성 (ZZX)[ZZX],3,11,6,8,25,0,0,0,0,0,3,11,6,8,25
총합,30,5789,5759,6277,17825,24,1171,1169,1160,3500,54,6960,6928,7437,21325

In [171]:
import pandas as pd

df = pd.read_html('https://ko.wikipedia.org/wiki/%EC%98%AC%EB%A6%BC%ED%94%BD_%EB%A9%94%EB%8B%AC_%EC%A7%91%EA%B3%84')
df2 = df[0].set_index('국가 (IOC 코드)')

summer = df2.iloc[:, :5]
summer

                  하계 참가 횟수  Unnamed: 2  Unnamed: 3  Unnamed: 4  Unnamed: 5
국가 (IOC 코드)
아프가니스탄 (AFG)            16           0           0           2           2
알바니아 (ALB)              10           0           0           2           2
알제리 (ALG)               15           7           4           9          20
아르헨티나 (ARG)             26          22          27          31          80
아르메니아 (ARM)              8           2          11           9          22
...                    ...         ...         ...         ...         ...
개인 중립 (AIN)[AIN]         1           1           3           1           1
독립 (IOA)[IOA]            3           1           0           1           2
독립 참가 (IOP)[IOP]         1           0           1           2           3
혼성 (ZZX)[ZZX]            3          11           6           8          25
총합                      30        5789        5759        6277       17825

[163 rows x 5 columns]

In [172]:
import pandas as pd

df = pd.read_html('https://ko.wikipedia.org/wiki/%EC%98%AC%EB%A6%BC%ED%94%BD_%EB%A9%94%EB%8B%AC_%EC%A7%91%EA%B3%84')
df2 = df[0].set_index('국가 (IOC 코드)')

summer = df2.iloc[:, :5]
summer.columns = ['경기수', '금', '은', '동', '합계']
summer

                  경기수     금     은     동     합계
국가 (IOC 코드)
아프가니스탄 (AFG)       16     0     0     2      2
알바니아 (ALB)         10     0     0     2      2
알제리 (ALG)          15     7     4     9     20
아르헨티나 (ARG)        26    22    27    31     80
아르메니아 (ARM)         8     2    11     9     22
...               ...   ...   ...   ...    ...
개인 중립 (AIN)[AIN]    1     1     3     1      1
독립 (IOA)[IOA]       3     1     0     1      2
독립 참가 (IOP)[IOP]    1     0     1     2      3
혼성 (ZZX)[ZZX]       3    11     6     8     25
총합                 30  5789  5759  6277  17825

[163 rows x 5 columns]

In [173]:
import pandas as pd

df = pd.read_html('https://ko.wikipedia.org/wiki/%EC%98%AC%EB%A6%BC%ED%94%BD_%EB%A9%94%EB%8B%AC_%EC%A7%91%EA%B3%84')
df2 = df[0].set_index('국가 (IOC 코드)')

summer = df2.iloc[:, :5]
summer.columns = ['경기수', '금', '은', '동', '합계']
summer = summer.sort_values('금', ascending=False)
summer

                         경기수     금     은     동     합계
국가 (IOC 코드)
총합                        30  5789  5759  6277  17825
미국 (USA)[P][Q][R][Z][F]   29  1101   874   780   2755
소련 (URS)[URS]              9   395   319   296   1010
중화인민공화국 (CHN)[CHN]        12   303   226   198    727
영국 (GBR)[GBR][Z]          30   298   340   343    981
...                      ...   ...   ...   ...    ...
탄자니아 (TAN)[TAN]           15     0     2     0      2
수단 (SUD)                  14     0     1     0      1
미국령 버진아일랜드 (ISV)          14     0     1     0      1
잠비아 (ZAM)[ZAM]            15     0     1     2      3
독립 참가 (IOP)[IOP]           1     0     1     2      3

[163 rows x 5 columns]

In [176]:
pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
   ---------------------------------------- 0.0/250.9 kB ? eta -:--:--
   --------- ------------------------------ 61.4/250.9 kB 1.7 MB/s eta 0:00:01
   ---------------------------------------- 250.9/250.9 kB 5.1 MB/s eta 0:00:00
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [177]:
import pandas as pd

df = pd.read_html('https://ko.wikipedia.org/wiki/%EC%98%AC%EB%A6%BC%ED%94%BD_%EB%A9%94%EB%8B%AC_%EC%A7%91%EA%B3%84')
df2 = df[0].set_index('국가 (IOC 코드)')

summer = df2.iloc[:, :5]
summer.columns = ['경기수', '금', '은', '동', '합계']
summer = summer.sort_values('금', ascending=False)
summer.to_excel('하계올림픽메달.xlsx')

In [178]:
import pandas as pd

df = pd.read_excel('하계올림픽메달.xlsx', index_col=0)
df.head()

                         경기수     금     은     동     합계
국가 (IOC 코드)
총합                        30  5789  5759  6277  17825
미국 (USA)[P][Q][R][Z][F]   29  1101   874   780   2755
소련 (URS)[URS]              9   395   319   296   1010
중화인민공화국 (CHN)[CHN]        12   303   226   198    727
영국 (GBR)[GBR][Z]          30   298   340   343    981

In [179]:
import pandas as pd

df = pd.read_excel('하계올림픽메달.xlsx')
df.head()

               국가 (IOC 코드)  경기수     금     은     동     합계
0                       총합   30  5789  5759  6277  17825
1  미국 (USA)[P][Q][R][Z][F]   29  1101   874   780   2755
2            소련 (URS)[URS]    9   395   319   296   1010
3       중화인민공화국 (CHN)[CHN]   12   303   226   198    727
4         영국 (GBR)[GBR][Z]   30   298   340   343    981

In [180]:
df['국가 (IOC 코드)'] == '대한민국 (KOR)'

0      False
1      False
2      False
3      False
4      False
       ...
158    False
159    False
160    False
161    False
162    False
Name: 국가 (IOC 코드), Length: 163, dtype: bool

In [181]:
df['국가 (IOC 코드)'].isin(['대한민국 (KOR)'])

0      False
1      False
2      False
3      False
4      False
       ...
158    False
159    False
160    False
161    False
162    False
Name: 국가 (IOC 코드), Length: 163, dtype: bool

In [184]:
df[df['국가 (IOC 코드)'].str.contains('대한민국 (KOR)')]

C:\Users\109-1\AppData\Local\Temp\ipykernel_14516\764405571.py:1: UserWarning: This pattern is interpreted as a regular expression, and has match groups. To actually get the groups, use str.extract.
  df[df['국가 (IOC 코드)'].str.contains('대한민국 (KOR)')]

Empty DataFrame
Columns: [국가 (IOC 코드), 경기수, 금, 은, 동, 합계]
Index: []

In [185]:
df[df['국가 (IOC 코드)'].str.contains('러시아')]

           국가 (IOC 코드)  경기수    금    은    동   합계
13      러시아 (RUS)[RUS]    6  147  126  150  423
100  러시아 제국 (RU1)[RU1]    3    1    4    3    8
150  러시아 출신 (OAR)[OAR]    0    0    0    0    0

In [186]:
import pandas as pd

df = pd.read_csv('age.csv', encoding='cp949', index_col=0)
df.head()

,2024년08월_계_총인구수,2024년08월_계_연령구간인구수,2024년08월_계_0세,2024년08월_계_1세,2024년08월_계_2세,2024년08월_계_3세,2024년08월_계_4세,2024년08월_계_5세,2024년08월_계_6세,2024년08월_계_7세,...,2024년08월_계_91세,2024년08월_계_92세,2024년08월_계_93세,2024년08월_계_94세,2024년08월_계_95세,2024년08월_계_96세,2024년08월_계_97세,2024년08월_계_98세,2024년08월_계_99세,2024년08월_계_100세 이상
행정구역,,,,,,,,,,,,,,,,,,,,,
서울특별시 (1100000000),"9,355,801","9,355,801","37,784","38,892","40,638","43,000","44,376","48,064","51,662","56,525",...,"9,445","7,537","5,283","4,259","3,541","2,474","1,682",950,644,"1,522"
서울특별시 종로구 (1111000000),"138,929","138,929",386,423,475,470,521,522,569,656,...,196,167,123,86,76,60,44,27,14,45
서울특별시 종로구 청운효자동(1111051500),"11,177","11,177",49,36,41,51,44,50,52,68,...,20,15,12,5,7,4,4,1,1,6
서울특별시 종로구 사직동(1111053000),"8,993","8,993",18,32,41,31,36,38,51,53,...,17,9,13,6,11,5,3,2,1,7
서울특별시 종로구 삼청동(1111054000),"2,229","2,229",3,8,7,7,4,5,14,8,...,6,7,3,5,1,2,1,0,0,1

In [187]:
import pandas as pd

df = pd.read_csv('age.csv', encoding='cp949', index_col=0)
df.dtypes

2024년08월_계_총인구수       object
2024년08월_계_연령구간인구수    object
2024년08월_계_0세         object
2024년08월_계_1세         object
2024년08월_계_2세         object
                       ...
2024년08월_계_96세        object
2024년08월_계_97세        object
2024년08월_계_98세        object
2024년08월_계_99세         int64
2024년08월_계_100세 이상    object
Length: 103, dtype: object

In [188]:
import pandas as pd

df = pd.read_csv('age.csv', encoding='cp949', index_col=0)

df = df.replace(',', '', regex=True)
df.head()

,2024년08월_계_총인구수,2024년08월_계_연령구간인구수,2024년08월_계_0세,2024년08월_계_1세,2024년08월_계_2세,2024년08월_계_3세,2024년08월_계_4세,2024년08월_계_5세,2024년08월_계_6세,2024년08월_계_7세,...,2024년08월_계_91세,2024년08월_계_92세,2024년08월_계_93세,2024년08월_계_94세,2024년08월_계_95세,2024년08월_계_96세,2024년08월_계_97세,2024년08월_계_98세,2024년08월_계_99세,2024년08월_계_100세 이상
행정구역,,,,,,,,,,,,,,,,,,,,,
서울특별시 (1100000000),9355801,9355801,37784,38892,40638,43000,44376,48064,51662,56525,...,9445,7537,5283,4259,3541,2474,1682,950,644,1522
서울특별시 종로구 (1111000000),138929,138929,386,423,475,470,521,522,569,656,...,196,167,123,86,76,60,44,27,14,45
서울특별시 종로구 청운효자동(1111051500),11177,11177,49,36,41,51,44,50,52,68,...,20,15,12,5,7,4,4,1,1,6
서울특별시 종로구 사직동(1111053000),8993,8993,18,32,41,31,36,38,51,53,...,17,9,13,6,11,5,3,2,1,7
서울특별시 종로구 삼청동(1111054000),2229,2229,3,8,7,7,4,5,14,8,...,6,7,3,5,1,2,1,0,0,1

In [189]:
import pandas as pd

df = pd.read_csv('age.csv', encoding='cp949', index_col=0)

df = df.replace(',', '', regex=True)

df = df.apply(pd.to_numeric)
df.dtypes

2024년08월_계_총인구수       int64
2024년08월_계_연령구간인구수    int64
2024년08월_계_0세         int64
2024년08월_계_1세         int64
2024년08월_계_2세         int64
                      ...
2024년08월_계_96세        int64
2024년08월_계_97세        int64
2024년08월_계_98세        int64
2024년08월_계_99세        int64
2024년08월_계_100세 이상    int64
Length: 103, dtype: object

In [190]:
pip install matplotlib

Collecting matplotlib
  Downloading matplotlib-3.9.3-cp312-cp312-win_amd64.whl.metadata (11 kB)
Collecting contourpy>=1.0.1 (from matplotlib)
  Downloading contourpy-1.3.1-cp312-cp312-win_amd64.whl.metadata (5.4 kB)
Collecting cycler>=0.10 (from matplotlib)
  Downloading cycler-0.12.1-py3-none-any.whl.metadata (3.8 kB)
Collecting fonttools>=4.22.0 (from matplotlib)
  Downloading fonttools-4.55.3-cp312-cp312-win_amd64.whl.metadata (168 kB)
     ---------------------------------------- 0.0/168.5 kB ? eta -:--:--
     -------------------------------------- 168.5/168.5 kB 5.1 MB/s eta 0:00:00
Collecting kiwisolver>=1.3.1 (from matplotlib)
  Downloading kiwisolver-1.4.7-cp312-cp312-win_amd64.whl.metadata (6.4 kB)
Requirement already satisfied: numpy>=1.23 in c:\users\109-1\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (2.2.0)
Requirement already satisfied: packaging>=20.0 in c:\users\109-1\appdata\roaming\python\python312\site-packages (from matplotlib) (24.2)
Collecting pillow>=8 (from matplotlib)
  Downloading pillow-11.0.0-cp312-cp312-win_amd64.whl.metadata (9.3 kB)
Collecting pyparsing>=2.3.1 (from matplotlib)
  Downloading pyparsing-3.2.0-py3-none-any.whl.metadata (5.0 kB)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\109-1\appdata\roaming\python\python312\site-packages (from matplotlib) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in c:\users\109-1\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.7->matplotlib) (1.17.0)
Downloading matplotlib-3.9.3-cp312-cp312-win_amd64.whl (7.8 MB)
   ---------------------------------------- 0.0/7.8 MB ? eta -:--:--
   ---- ----------------------------------- 0.8/7.8 MB 16.8 MB/s eta 0:00:01
   ------------- -------------------------- 2.7/7.8 MB 34.5 MB/s eta 0:00:01
   -------------------------- ------------- 5.2/7.8 MB 41.2 MB/s eta 0:00:01
   ---------------------------------------- 7.8/7.8 MB 45.5 MB/s eta 0:00:00
Downloading contourpy-1.3.1-cp312-cp312-win_amd64.whl (220 kB)
   ---------------------------------------- 0.0/221.0 kB ? eta -:--:--
   --------------------------------------- 221.0/221.0 kB 13.2 MB/s eta 0:00:00
Downloading cycler-0.12.1-py3-none-any.whl (8.3 kB)
Downloading fonttools-4.55.3-cp312-cp312-win_amd64.whl (2.2 MB)
   ---------------------------------------- 0.0/2.2 MB ? eta -:--:--
   ---------------------------------------- 2.2/2.2 MB 146.6 MB/s eta 0:00:00
Downloading kiwisolver-1.4.7-cp312-cp312-win_amd64.whl (55 kB)
   ---------------------------------------- 0.0/55.9 kB ? eta -:--:--
   ---------------------------------------- 55.9/55.9 kB ? eta 0:00:00
Downloading pillow-11.0.0-cp312-cp312-win_amd64.whl (2.6 MB)
   ---------------------------------------- 0.0/2.6 MB ? eta -:--:--
   ---------------- ----------------------- 1.0/2.6 MB ? eta -:--:--
   -------------------------------- ------- 2.1/2.6 MB 33.5 MB/s eta 0:00:01
   ---------------------------------------- 2.6/2.6 MB 23.5 MB/s eta 0:00:00
Downloading pyparsing-3.2.0-py3-none-any.whl (106 kB)
   ---------------------------------------- 0.0/106.9 kB ? eta -:--:--
   ---------------------------------------- 106.9/106.9 kB ? eta 0:00:00
Installing collected packages: pyparsing, pillow, kiwisolver, fonttools, cycler, contourpy, matplotlib
Successfully installed contourpy-1.3.1 cycler-0.12.1 fonttools-4.55.3 kiwisolver-1.4.7 matplotlib-3.9.3 pillow-11.0.0 pyparsing-3.2.0
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [192]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

df = pd.read_csv('age.csv', encoding='cp949', index_col=0)

df = df.replace(',', '', regex=True)
df = df.apply(pd.to_numeric)

df = df[df[df.columns[0]] != 0]

In [195]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

df = pd.read_csv('age.csv', encoding='cp949', index_col=0)

df = df.replace(',', '', regex=True)
df = df.apply(pd.to_numeric)

df = df[df[df.columns[0]] != 0]
df = df.div(df[df.columns[0]], axis='index')

print(df.head(3))

                             2024년08월_계_총인구수  2024년08월_계_연령구간인구수  \
행정구역
서울특별시  (1100000000)                      1.0                 1.0
서울특별시 종로구 (1111000000)                   1.0                 1.0
서울특별시 종로구 청운효자동(1111051500)              1.0                 1.0

                             2024년08월_계_0세  2024년08월_계_1세  2024년08월_계_2세  \
행정구역
서울특별시  (1100000000)               0.004039       0.004157       0.004344
서울특별시 종로구 (1111000000)            0.002778       0.003045       0.003419
서울특별시 종로구 청운효자동(1111051500)       0.004384       0.003221       0.003668

                             2024년08월_계_3세  2024년08월_계_4세  2024년08월_계_5세  \
행정구역
서울특별시  (1100000000)               0.004596       0.004743       0.005137
서울특별시 종로구 (1111000000)            0.003383       0.003750       0.003757
서울특별시 종로구 청운효자동(1111051500)       0.004563       0.003937       0.004473

                             2024년08월_계_6세  2024년08월_계_7세  ...  \
행정구역                                                       ...
서울특별시  (1100000000)               0.005522       0.006042  ...
서울특별시 종로구 (1111000000)            0.004096       0.004722  ...
서울특별시 종로구 청운효자동(1111051500)       0.004652       0.006084  ...

                             2024년08월_계_91세  2024년08월_계_92세  2024년08월_계_93세  \
행정구역
서울특별시  (1100000000)                0.001010        0.000806        0.000565
서울특별시 종로구 (1111000000)             0.001411        0.001202        0.000885
서울특별시 종로구 청운효자동(1111051500)        0.001789        0.001342        0.001074

                             2024년08월_계_94세  2024년08월_계_95세  2024년08월_계_96세  \
행정구역
서울특별시  (1100000000)                0.000455        0.000378        0.000264
서울특별시 종로구 (1111000000)             0.000619        0.000547        0.000432
서울특별시 종로구 청운효자동(1111051500)        0.000447        0.000626        0.000358

                             2024년08월_계_97세  2024년08월_계_98세  2024년08월_계_99세  \
행정구역
서울특별시  (1100000000)                0.000180        0.000102        0.000069
서울특별시 종로구 (1111000000)             0.000317        0.000194        0.000101
서울특별시 종로구 청운효자동(1111051500)        0.000358        0.000089        0.000089

                             2024년08월_계_100세 이상
행정구역
서울특별시  (1100000000)                    0.000163
서울특별시 종로구 (1111000000)                 0.000324
서울특별시 종로구 청운효자동(1111051500)            0.000537

[3 rows x 103 columns]

In [197]:
import pandas as pd

df = pd.read_csv('age.csv', encoding='cp949', index_col=0)
df = df.replace(',', '', regex=True)

df = df.apply(pd.to_numeric)

df = df[df[df.columns[0]] != 0]

df = df.div(df['2024년08월_계_총인구수'], axis='index')
del df['2024년08월_계_총인구수'], df['2024년08월_계_연령구간인구수']

df.head(3)

,2024년08월_계_0세,2024년08월_계_1세,2024년08월_계_2세,2024년08월_계_3세,2024년08월_계_4세,2024년08월_계_5세,2024년08월_계_6세,2024년08월_계_7세,2024년08월_계_8세,2024년08월_계_9세,...,2024년08월_계_91세,2024년08월_계_92세,2024년08월_계_93세,2024년08월_계_94세,2024년08월_계_95세,2024년08월_계_96세,2024년08월_계_97세,2024년08월_계_98세,2024년08월_계_99세,2024년08월_계_100세 이상
행정구역,,,,,,,,,,,,,,,,,,,,,
서울특별시 (1100000000),0.004039,0.004157,0.004344,0.004596,0.004743,0.005137,0.005522,0.006042,0.006869,0.007166,...,0.001010,0.000806,0.000565,0.000455,0.000378,0.000264,0.000180,0.000102,0.000069,0.000163
서울특별시 종로구 (1111000000),0.002778,0.003045,0.003419,0.003383,0.003750,0.003757,0.004096,0.004722,0.005895,0.005564,...,0.001411,0.001202,0.000885,0.000619,0.000547,0.000432,0.000317,0.000194,0.000101,0.000324
서울특별시 종로구 청운효자동(1111051500),0.004384,0.003221,0.003668,0.004563,0.003937,0.004473,0.004652,0.006084,0.008052,0.006621,...,0.001789,0.001342,0.001074,0.000447,0.000626,0.000358,0.000358,0.000089,0.000089,0.000537